tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "bash"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "jq"
brew "keychain"
brew "libtool"
brew "libxmlsec1"
brew "maven"
brew "mysql"
brew "pyenv"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tree"
brew "vim"
brew "wget"
cask "font-fira-code"
