tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "dep"
brew "fd"
brew "git"
brew "gnupg"
brew "htop"
brew "hub"
brew "jq"
brew "keychain"
brew "libtool"
brew "libxmlsec1"
brew "maven"
brew "mysql"
brew "ripgrep"
brew "ruby"
brew "travis"
brew "tree"
brew "vim"
brew "wget"
cask "java8"
