tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "bash"
brew "bat"
brew "fd"
brew "git"
brew "gnupg"
brew "htop"
brew "hub"
brew "jq"
brew "keychain"
brew "maven"
brew "ruby"
brew "the_silver_searcher"
brew "tree"
brew "vim"
brew "wget"
cask "java8"
