tap "homebrew/bundle"
# Record and share terminal sessions
brew "asciinema"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Language Server for Bash
brew "bash-language-server"
# Python code formatter
brew "black"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Load/unload environment variables based on $PWD
brew "direnv"
# General purpose Language Server
brew "efm-langserver"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Linting for your git commit messages
brew "gitlint"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Language server for the Go language
brew "gopls"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Generic library support script
brew "libtool"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server for the Lua language
brew "lua-language-server"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Language Server Protocol for Markdown
brew "marksman"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Python version management
brew "pyenv"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Internet file retriever
brew "wget"
# Language Server for Yaml Files
brew "yaml-language-server"
# Tool for managing your YubiKey configuration
brew "ykman"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# JetBrains tools manager
cask "jetbrains-toolbox"
# GPU-based terminal emulator
cask "kitty"
